Revit 2024 API
AreaBasedLoadData.PowerFactor Property
 The power factor of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double PowerFactor { get; }
Visual Basic
Public ReadOnly Property PowerFactor As Double
	Get
Visual C++
public:
property double PowerFactor {
	double get ();
}
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace